<!-- dflook/terraform-github-actions {"workspace":"destroy-test-2","backend":"d818bc4b6df0253546f5d1c088eecf7a00a37e1475038c7cf7e3996c9969151e","backend_type":"remote","plan_job_ref":"Job Test Terraform cloud #110 at https://github.com/dflook/terraform-github-actions/actions/runs/3547050504","plan_hash":"39291953c19aa08d26f4a83e6d002c2e06873d9437fb7b5ffbd27e568095db51","plan_text_format":"text"} -->
Terraform plan in __tests/workflows/test-cloud/1.0__ in the __destroy-test-2__ workspace
With var files: `tests/workflows/test-cloud/1.0/my_variable.tfvars
`
With variables: `from_variables = "from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_id.the_id will be created
  + resource "random_id" "the_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 5
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + default        = "default"
  + from_tfvars    = "from_tfvars"
  + from_variables = "from_variables"
```
</details>

:memo: Plan generated in [Test Terraform cloud #110](https://github.com/dflook/terraform-github-actions/actions/runs/3547050504)